package com.impuls.billing.side_billing.model.in_dto.tariff

data class TarifResponse(
    val tarId: Long, //		Идентификатор тарифа
    val actualtarId: Long, //		Не используется
    val shape: Long, //		Ограничение полосы пропускания Кбит/с
    val traffLimit: Long, //		Ограничение потребления трафика за период. Если установлено значение 0 — ограничений нет. Если установлено значение, отличное от нуля, то единица измерения зависит от типа тарифа:  тип 0 или 1 — ограничение в Мб тип 2 — ограничение в минутах
    val traffLimitPer: Long, //		Период в днях, на который установлено ограничение trafflimit (0 — календарный месяц)
    val type: Long, //		Тип тарифа 0 — Выделенная линия 1 — Dialup (по объёму) 2 — Dialup (по времени) 3 — Телефония 4 — IP-телефония 5 — Услуги
    val actbLock: Long, //		Сочетание признаков «Блокировать учётные записи» и «Порядок оплаты» 0 — Не блокировать учётные записи, Предоплата 1 — Блокировать учётные записи, Постоплата 2 — Блокировать учётные записи, Предоплата 3 — Не блокировать учётные записи, Постоплата
    val archive: Long, //		Флаг «Тариф удалён»
    val pricePlan: Long, //		Денежный план. Поле отсутствует в интерфейсе
    val traffType: Long, //		Тарифицируемый трафик: 1 — входящий 2 — исходящий 3 — сумма 4 — превалирующий Используется для тарифов с типами: 0, 1, 2
    val dailyRent: Long, //		Периодичность списания 0 — один раз в начале месяца 1 — равномерно каждый день
    val dynamicRent: Long, //		Списание средства 0 — фиксировано (в полном объёме) 1 — динамически (пропорционально дням) 2 — комбинировано
    val shapePrior: Long, //		Приоритет правил изменения пропускной способности: 0 — по минимальному значению 1 — по объему 2 — по времени 3 — по минимальному значению
    val unavaliable: Long, //		Флаг «Менеджер не может назначить тариф»
    val rentmultiply: Long, //		Флаг «Списывать абонентскую плату кратно телефонным номерам учётной записи»
    val chargeIncoming: Long, //		Как будут тарифицироваться входящие звонки: 0 — Не тарифицировать 1 — Номер вызывающей станции 2 — Набранный номер
    val curId: Long, //		Идентификатор валюты тарифа из справочника валют
    val used: Long, //		Флаг «тариф используется» 0 — тариф не связан ни с одной учетной записью — поле заполнено 1 — тариф связан хотя бы с одной учётной записью Если тариф не связан ни с одной учетной записью — поле заполнено 0 (FALSE), в противном случае 1 (TRUE)
    val voipBlockLocal	: Long, //		Блокировать направления, не найденные в каталоге. Используется только для тарифов VoIP-телефонии
    val dynRoute: Long, //		Признак динамической маршрутизации VoIP звонков: 0 — не использовать 1 — LCR 2 — MWR
    val serviceType: Long, //		Тип услуг: 0 — Прочее 1 — ЦТВ 2 — КТВ
    val blockRentDuration: Long, //		Через сколько дней финансовой блокировки отключать УЗ
    val rent: Double, //		Абонентская плата в валюте тарифа
    val blockRent: Double, //		Абонентская плата при блокировке по балансу в валюте тарифа
    val usrBlockRent: Double, //		Абонентская плата при пользовательской блокировке в валюте тарифа
    val admBlockRent: Double, //		Абонентская плата при административной блокировке в валюте тарифа
    val coefLow: Double, //		Допустимый размер скидки от базовой АП — нижняя граница
    val coefHigh: Double, //		Допустимый размер скидки от базовой АП — верхняя граница
    val catNumbers: Long, //		Список идентификаторов категорий тарифа
    val descr: String, //		Название
    val descrFull: String, //		Описание
    val symbol: String, //		Сокращенное обозначение валюты
    val link: String, //		Ссылка на описание
    val uuid: String, //		Внешний идентификатор
    val saleDictionAryId: Long, //		Код услуги
    val additional: Long, //		Признак дополнительного тарифа: 0 — основной тариф, 1 — дополнительный тариф. Примечание: механизм дополнительных тарифов используется только для телефонии
    val commonIncludes: Long, //		Минуты, которые включены в абонентскую плату
    val useCommonIncludes: Long, //		Флаг «Использовать пакет минут»
    val checkActiveHours: Long, //		Флаг «Списывать средства, только если тариф был активен больше 12 часов в сутки»
    val rentAsAervice: Long, //		Флаг «Абонентская плата как дополнительная услуга»
    val availableFl: Long, //		Признак «Тариф доступен для назначения физлицам»
    val availableUl: Long, //		Признак «Тариф доступен для назначения юрлицам»
    val availableSp: Long, //		Признак «Тариф доступен для назначения ИП»	2.0.54
    val organizationId: Long, //		Идентификатор организации к которой относится тариф	2.0.48
    val orgtarId: Long, //		Идентфикатор тарифа внутри организации	2.0.48
    val organizationName: String, //		Название организации, к которой относится тариф
)