package com.impuls.billing.side_billing.model.in_dto

data class SharedPostResponse (
    /**
     * Идентификатор широковещательного сообщения
     */
    val pid: Long,

    /**
     * Менеджер, оставивший сообщение
     */
    val postBy: Long,

    /**
     * Путь информирования:
     * * 0 — сообщение в личном кабинете
     * * 1 — сообщение на электронную почту
     * * 2 — спецпредложение
     */
    val postTo: Long,

    /**
     * Идентификатор группы пользователей, которой адресовано сообщение
     */
    val groupId: Long,

    /**
     * Идентификатор пользователя, которому адресовано сообщение
     */
    val uid: Long,

    /**
     * Дата и время создания сообщения
     */
    val postTime: String,

    /**
     * Текст сообщения
     */
    val text: String,

    /**
     * Тема сообщения
     */
    val subject: String,

    /**
     * Дата и время публикации (запланировано на дату)
     */
    val sentTime: String,

    /**
     * Статус сообщения:
     * * 0 — создано
     * * 1 — опубликовано
     * * 2 — публикация завершена
     */
    val status: Long,

    /**
     * Идентификатор категории широковещательных сообщений
     */
    val postCatId: Long,

    /**
     * Дата начала действия спецпредложения
     */
    val dtFrom: String,

    /**
     * Дата завершения спецпредложения
     */
    val dtTo: String,

    /**
     * Список email-адресов для уведомления о заявке на спецпредложение (строкой)
     */
    val emails: String,

    /**
     * Внешний адрес для уведомления о заявке на спецпредложение
     */
    val externUrl: String
)