package com.impuls.billing.side_billing.model.in_dto

data class TarifsStaffResponse(
    val groupId: Long, //		Идентификатор группы тарифов
    val groupTarId: Long, //		Идентификатор тарифного плана вокруг которого собрана группа
    val groupModuleId: Long, //		Идентификатор сетевого агента
    val tarId: Long, //		Идентификатор тарифного плана, который является частью группы
    val tarType: Long, //		Идентификатор типа тарифного плана. 0 -- выделенная линия; 1 -- DialUP по объему; 2 -- DialUP по времени; 3 -- телефония; 4 -- IP-телефония; 5 -- услуги (тариф UsBox-услуг)
    val tarCurId: Long, //		Идентификатор валюты, в которой задана абонентская плата тарифного плана
    val shape: Long, //		Ограничение полосы пропускания для тарифных планов услуги "Интернет"
    val rent: Double, //		Величиная абонентской платы по тарифному плану
    val tarName: String, //		Название тарифного плана, который является участником группы
    val tarSymbol: String, //		Символ валюты в которой задана абонентская плата тарифного плана (участника группы)
    val tarDescrFull: String, //		Описание тарифного плана, который является участником группы
)
