package com.impuls.billing.side_billing.model.in_dto.client_vgroup

data class AddressBriefResponse(
    /**
     * Тип адреса. Зависит от того, с каким адресом работает функция.
     *
     * Для учётной записи всегда нужно передавать 0 — адрес подключения.
     *
     * Для пользователя доступны три типа:
     * * 0 — юридический адрес (адрес прописки)
     * * 1 — фактический адрес (адрес проживания)
     * * 2 — адрес доставки
     */
    val type: Long,

    /**
     * Строка чисел, которые разделены запятыми.
     * Соответствует результату, возвращаемому функцией getAddressIndexes
     */
    val code: String,

    /**
     * Расшифровка адреса в формате:
     * <страна>, <тип> <регион>, <тип> <район>, <тип> <город>, <тип> <населённый пункт>,
     * <тип> <улица>, <тип> <здание>, <тип> <квартира>, <тип> <подъезд>, <тип> <этаж>
     *
     * Тип — это сокращённое название типа из КЛАДР
     */
    val address: String,

    /**
     * Код здания для связки с внешней системой
     */
    val buildIngUud: String
)
