package com.impuls.billing.side_billing.model.in_dto.usbox_service

data class UsboxServiceResponse(
    /**
     * Флаг, отвечающий за идентификацию вида услуги:
     * * 1 — дополнительная услуга
     * * 0 — USBOX-услуга
     */
    val notusbox: Long,

    /**
     * Идентификатор записи в БД
     */
    val servid: Long,

    /**
     * Идентификатор учетной записи
     */
    val vgid: Long,

    /**
     * Идентификатор тарифного плана
     */
    val tarid: Long,

    /**
     * Идентификатор тарифной категории (notusbox = 0) или
     * дополнительной услуги из каталога (notusbox = 1)
     */
    val catidx: Long,

    /**
     * Признак необходимости тарификации услуги:
     * * 1 — тарифицировать
     * * 0 — не тарифицировать
     */
    val needcalc: Long,

    /**
     * Устаревший параметр
     */
    val noduplicate: Long,

    /**
     * Устаревший параметр
     */
    val planid: Long,

    /**
     * Идентификатор метода рассрочки платежа
     */
    val installmentduration: Long,

    /**
     * Текущее состояние услуги:
     * * 0 — отключена, не активирована
     * * 1 — включена, не активирована
     * * 2 — выключена, активирована
     * * 3 — включена, активирована
     */
    val state: Long,

    /**
     * Текущий статус учётной записи:
     * * 0 — активна
     * * 1 — заблокирована по балансу
     * * 2 — заблокирована пользователем
     * * 3 — заблокирована администратором
     * * 4 — заблокирована по балансу
     * * 5 — заблокирована по лимиту трафика
     * * 10 — отключена
     */
    val blocked: Long,

    /**
     * Величина первого платежа при рассрочке
     */
    val installmentfirstpayment: Double,

    /**
     * В каком количестве оказана услуга (множитель для стоимости услуги из тарифа)
     */
    val mul: Double,

    /**
     * Величина скидки в процентах
     */
    val rate: Double,

    /**
     * Коэффициент скидки на АП тарифного плана
     */
    val discount: Double,

    /**
     * Коэффициент скидки на АПпБ учётной записи
     */
    val blockdiscount: Double,

    /**
     * Идентификатор менеджера
     */
    val personid: String,

    /**
     * Комментарий к назначенной услуге
     */
    val comment: String,

    /**
     * Дата назначения услуги — время, когда менеджер или пользователь активировал действие этой услуги
     * Формат: YYYY-MM-DD HH24:MI:SS
     */
    val created: String,

    /**
     * Дата начала оказания услуги
     * Формат: YYYY-MM-DD HH24:MI:SS
     */
    val timefrom: String,

    /**
     * Дата завершения оказания услуги
     * Формат: YYYY-MM-DD HH24:MI:SS
     */
    val timeto: String,

    /**
     * Дата начала тарификации услуги
     * Формат: YYYY-MM-DD HH24:MI:SS
     */
    val activated: String,

    /**
     * Начало действия модификатора для тарифа
     */
    val discounttimefrom: String,

    /**
     * Окончание действия модификатора для тарифа
     */
    val discounttimeto: String,

    /**
     * Используется для хранения абстрактных данных внешних приложений
     */
    val externaldata: String,

    /**
     * Параметры скидки на услугу
     */
    val modifiers: TariffModifierResponse
)
